from telethon import events, functions, types
from telethon.tl import functions as tl_functions
import asyncio
from collections import defaultdict

def register(client):
    @client.on(events.NewMessage(pattern=r'^\.م3$'))
    async def show_group_commands(event):
        menu = """
╔═✦═━《⛧ 𝗔𝗮𝘇𝗲𝗳 ⛧》━═✦═╗

⌯ م3➪  اوامــر الجروبات
✧ .نشر تلقائي <النص المراد نشره> ⌯ نشر في جميع الجروبات في الحساب
✧ .طرد ⌯ طرد العضو المشار إليه (الأونر أو الأدمن فقط)
✧ .كتم ⌯ كتم العضو المشار إليه (الأونر أو الأدمن فقط)
✧ .الغاء كتم ⌯ إلغاء كتم العضو المشار إليه (الأونر أو الأدمن فقط)
✧ .تفليش ⌯ طرد جميع أعضاء الجروب والأدمنية [للأونر فقط]
✧ .تفليش الجروب ⌯ طرد جميع أعضاء الجروب [للأونر والأدمن]
✧ .تحذير ⌯ بالرد على العضو؛ كل عضو له 3 تحذيرات، عند 3 تحذيرات يتم الطرد تلقائيًا
✧ .مسح التحذيرات ⌯ بالرد على العضو لمسح أي تحذير عليه
✧ .رفع ادمن ⌯ إعطاء صلاحية الأدمن للعضو المشار إليه (للأونر والأدمن في الجروب)
✧ .تنزيل ⌯ إزالة أي أدمن مهما كانت صلاحياته (للأونر فقط)

╚═✦═━《 𝗦𝗢𝗨𝗥𝗖𝗘 𝗔𝗮𝘇𝗲𝗳 ⛧ 》━═✦═╝
⌯ المطور: @T_8l8
"""
        await event.reply(menu)


    # باقي الأوامر بنفس الطريقة...
